# Feature selection

In [19]:
import pandas as pd
import numpy as np

In [20]:
from sklearn.linear_model import Lasso
from sklearn.feature_selection import SelectFromModel

In [21]:
model=SelectFromModel(Lasso(alpha=0.005,random_state=0))

In [22]:
data_frame=pd.read_csv('modified_csv.csv')
data_frame.head()

,age,workclass,fnlwgt,education,education_num,marital_status,occupation,relationship,race,sex,capital_gain,capital_loss,hours_per_week,native_country,wage_class
0,0.540509,0.500,0.495348,0.866667,0.800000,0.833333,0.785714,0.8,1.00,1.0,0.098639,0.0,0.849228,1.000000,1
1,0.702243,0.875,0.514735,0.866667,0.800000,1.000000,0.857143,1.0,1.00,1.0,0.000000,0.0,0.590484,1.000000,1
2,0.523600,1.000,0.770478,1.000000,0.533333,0.666667,0.357143,0.8,1.00,1.0,0.000000,0.0,0.849228,1.000000,1
3,0.740173,1.000,0.793270,0.666667,0.400000,1.000000,0.357143,1.0,0.75,1.0,0.000000,0.0,0.849228,1.000000,1
4,0.324814,1.000,0.891650,0.866667,0.800000,1.000000,1.000000,0.2,0.75,0.0,0.000000,0.0,0.849228,0.780488,1

In [23]:
x=data_frame.iloc[:,:-1]
y=data_frame.iloc[:,-1]

In [24]:
model.fit(x,y)

SelectFromModel(estimator=Lasso(alpha=0.005, random_state=0))

In [26]:
model.get_support()

array([ True, False, False,  True,  True,  True,  True,  True, False,
        True,  True, False, False, False])

In [31]:
features_to_select=[]
for i,j in zip(x.columns,model.get_support()):
    if j==True:
        features_to_select.append(i)

In [32]:
data_frame[features_to_select].head()

,age,education,education_num,marital_status,occupation,relationship,sex,capital_gain
0,0.540509,0.866667,0.800000,0.833333,0.785714,0.8,1.0,0.098639
1,0.702243,0.866667,0.800000,1.000000,0.857143,1.0,1.0,0.000000
2,0.523600,1.000000,0.533333,0.666667,0.357143,0.8,1.0,0.000000
3,0.740173,0.666667,0.400000,1.000000,0.357143,1.0,1.0,0.000000
4,0.324814,0.866667,0.800000,1.000000,1.000000,0.2,0.0,0.000000

In [33]:
final_data=data_frame[features_to_select]

In [35]:
final_data['wage_class']=data_frame['wage_class']

<ipython-input-35-b08169ce1f37>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  final_data['wage_class']=data_frame['wage_class']

In [36]:
final_data.head()

,age,education,education_num,marital_status,occupation,relationship,sex,capital_gain,wage_class
0,0.540509,0.866667,0.800000,0.833333,0.785714,0.8,1.0,0.098639,1
1,0.702243,0.866667,0.800000,1.000000,0.857143,1.0,1.0,0.000000,1
2,0.523600,1.000000,0.533333,0.666667,0.357143,0.8,1.0,0.000000,1
3,0.740173,0.666667,0.400000,1.000000,0.357143,1.0,1.0,0.000000,1
4,0.324814,0.866667,0.800000,1.000000,1.000000,0.2,0.0,0.000000,1

In [37]:
final_data.to_csv('final_data.csv',index=False)

In [38]:
final_data['wage_class'].unique()

array([1, 0])